Revit 2024 API
StructuralConnectionHandler.GetInputReferences Method
 Gets references of input elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IList<Reference> GetInputReferences()
Visual Basic
Public Function GetInputReferences As IList(Of Reference)
Visual C++
public:
IList<Reference^>^ GetInputReferences()
See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace